ChenDudo/DAPLink/source/hic_hal/mm32/mm32f3270/usbd_mm32F3270 copy.c
/*
 * Copyright (c) 2004-2016 ARM Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*----------------------------------------------------------------------------
*      RL-ARM - USB
*----------------------------------------------------------------------------
*      Name:    usbd_MM32F3270.c
*      Purpose: Hardware Layer module for ST STM32F103
*      Rev.:    V4.70
*---------------------------------------------------------------------------*/

/* Double Buffering is not supported                                         */

#include <rl_usb.h>
#include "mm32_device.h"
#include "hal_gpio.h"
#include "hal_rcc.h"
#include "hal_misc.h"
#include "reg_usb_otg_fs.h"
#include "IO_Config.h"
#include "cortex_m.h"
#include "string.h"

#define __NO_USB_LIB_C
#include "usb_config.c"


////////////////////////////////////////////////////////////////////////////////
//! Define Buffer Descripter Table
////////////////////////////////////////////////////////////////////////////////
 #if defined(__ICCARM__)
 #define USB_WEAK_VAR                    __attribute__((weak))
 #define USB_WEAK_FUN                    __attribute__((weak))
 _Pragma("diag_suppress=Pm120")
 #define USB_ALIGN_PRAGMA(x)             _Pragma(#x)
 _Pragma("diag_default=Pm120")
 #define USB_RAM_ADDRESS_ALIGNMENT(n)    USB_ALIGN_PRAGMA(data_alignment = n)
 _Pragma("diag_suppress=Pm120")
 #define USB_LINK_SECTION_PART(str)      _Pragma(#str)
 #define USB_LINK_DMA_INIT_DATA(sec)     USB_LINK_SECTION_PART(location = #sec)
 #define USB_LINK_USB_GLOBAL             _Pragma("location = \"m_usb_global\"")
 #define USB_LINK_USB_BDT                _Pragma("location = \"m_usb_bdt\"")
 #define USB_LINK_USB_GLOBAL_BSS         _Pragma("location = \".bss.m_usb_global\"")
 #define USB_LINK_USB_BDT_BSS            _Pragma("location = \".bss.m_usb_bdt\"")
 _Pragma("diag_default=Pm120")
 #define USB_LINK_DMA_NONINIT_DATA       _Pragma("location = \"m_usb_dma_noninit_data\"")
 #define USB_LINK_NONCACHE_NONINIT_DATA  _Pragma("location = \"NonCacheable\"")

 #elif defined(__CC_ARM)
 #define USB_WEAK_VAR                    __attribute__((weak))
 #define USB_WEAK_FUN                    __weak
 #define USB_RAM_ADDRESS_ALIGNMENT(n)    __attribute__((aligned(n)))
 #define USB_LINK_DMA_INIT_DATA(sec)     __attribute__((section(#sec)))
 #define USB_LINK_USB_GLOBAL             __attribute__((section("m_usb_global")))            __attribute__((zero_init))
 #define USB_LINK_USB_BDT                __attribute__((section("m_usb_bdt")))               __attribute__((zero_init))
 #define USB_LINK_USB_GLOBAL_BSS         __attribute__((section(".bss.m_usb_global")))       __attribute__((zero_init))
 #define USB_LINK_USB_BDT_BSS            __attribute__((section(".bss.m_usb_bdt")))          __attribute__((zero_init))
 #define USB_LINK_DMA_NONINIT_DATA       __attribute__((section("m_usb_dma_noninit_data")))  __attribute__((zero_init))
 #define USB_LINK_NONCACHE_NONINIT_DATA  __attribute__((section("NonCacheable")))            __attribute__((zero_init))

 #elif defined(__GNUC__)
 #define USB_WEAK_VAR                    __attribute__((weak))
 #define USB_WEAK_FUN                    __attribute__((weak))
 #define USB_RAM_ADDRESS_ALIGNMENT(n)    __attribute__((aligned(n)))
 #define USB_LINK_DMA_INIT_DATA(sec)     __attribute__((section(#sec)))
 #define USB_LINK_USB_GLOBAL             __attribute__((section("m_usb_global, \"aw\", %nobits @")))
 #define USB_LINK_USB_BDT                __attribute__((section("m_usb_bdt, \"aw\", %nobits @")))
 #define USB_LINK_USB_GLOBAL_BSS         __attribute__((section(".bss.m_usb_global, \"aw\", %nobits @")))
 #define USB_LINK_USB_BDT_BSS            __attribute__((section(".bss.m_usb_bdt, \"aw\", %nobits @")))
 #define USB_LINK_DMA_NONINIT_DATA       __attribute__((section("m_usb_dma_noninit_data, \"aw\", %nobits @")))
 #define USB_LINK_NONCACHE_NONINIT_DATA  __attribute__((section("NonCacheable, \"aw\", %nobits @")))

 #else
 #error The tool-chain is not supported.
 #endif

typedef enum _usb_khci_interrupt_type {
    kUSB_KhciInterruptReset = 0x01U,
    kUSB_KhciInterruptError = 0x02U,
    kUSB_KhciInterruptSofToken = 0x04U,
    kUSB_KhciInterruptTokenDone = 0x08U,
    kUSB_KhciInterruptSleep = 0x10U,
    kUSB_KhciInterruptResume = 0x20U,
    kUSB_KhciInterruptAttach = 0x40U,
    kUSB_KhciInterruptStall = 0x80U,
} usb_khci_interrupt_type_t;

/*! @brief How many endpoints are supported in the stack. */
#define USB_DEVICE_CONFIG_ENDPOINTS 	(6U)

/* USB  standard descriptor endpoint type */
#define USB_ENDPOINT_CONTROL        (0x00U)
#define USB_ENDPOINT_ISOCHRONOUS    (0x01U)
#define USB_ENDPOINT_BULK           (0x02U)
#define USB_ENDPOINT_INTERRUPT      (0x03U)

#define MIN_BUF_SIZE                	(64)
#define USB_ENDPOINT_NUMBER_MASK		(0x0FU)
#define USB_SETUP_PACKET_SIZE 			(8U)

#define USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_MASK  (0x80U)
#define USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT (7U)
#define USB_IN_MASK                 	(0x80)
#define USB_OUT 						(0U)
#define USB_IN 							(1U)

#define USB_LOGICAL_EP_MASK         	(0x7f)
#define USB_CONTROL_ENDPOINT        	(0U)
#define USB_CONTROL_MAX_PACKET_SIZE 	(64U)

#define USB_KHCI_BDT_DEVICE_OUT_TOKEN   (0x01U)
#define USB_KHCI_BDT_DEVICE_IN_TOKEN    (0x09U)
#define USB_KHCI_BDT_DEVICE_SETUP_TOKEN (0x0DU)
#define USB_KHCI_BDT_OWN                (0x80U)

#define USB_KHCI_BDT_DATA01(x)          ((((uint32_t)(x)) & 0x01U) << 0x06U)
#define USB_KHCI_BDT_BC(x)              ((((uint32_t)(x)) & 0x3FFU) << 0x10U)
#define UBS_KHCI_BDT_KEEP               (0x20U)
#define UBS_KHCI_BDT_NINC               (0x10U)
#define USB_KHCI_BDT_DTS                (0x08U)
#define USB_KHCI_BDT_STALL              (0x04U)

#define USB_SHORT_TO_LITTLE_ENDIAN(n) (n)
#define USB_LONG_TO_LITTLE_ENDIAN(n) (n)
#define USB_SHORT_FROM_LITTLE_ENDIAN(n) (n)
#define USB_LONG_FROM_LITTLE_ENDIAN(n) (n)

