ChenDudo/DAPLink/source/hic_hal/mm32/mm32f3270/usbd_mm32F3270 copy.c
/* Set up packet structure */
typedef struct _usb_setup_struct {
    uint8_t bmRequestType;
    uint8_t bRequest;
    uint16_t wValue;
    uint16_t wIndex;
    uint16_t wLength;
} usb_setup_struct_t;

/*! @brief Endpoint state structure */
typedef struct _usb_device_khci_endpoint_state_struct {
    uint8_t* transferBuffer; /*!< Address of buffer containing the data to be transmitted */
    uint32_t transferLength; /*!< Length of data to transmit. */
    uint32_t transferDone;   /*!< The data length has been transferred*/
    union {
        uint32_t state; /*!< The state of the endpoint */
        struct {
            uint32_t maxPacketSize : 10U; /*!< The maximum packet size of the endpoint */
            uint32_t stalled : 1U;        /*!< The endpoint is stalled or not */
            uint32_t data0 : 1U;          /*!< The data toggle of the transaction */
            uint32_t bdtOdd : 1U;         /*!< The BDT toggle of the endpoint */
            uint32_t dmaAlign : 1U;       /*!< Whether the transferBuffer is DMA aligned or not */
            uint32_t transferring : 1U;   /*!< The endpoint is transferring */
            uint32_t zlt : 1U;            /*!< zlt flag */
        } stateBitField;
    } stateUnion;
} usb_device_khci_endpoint_state_struct_t;

/*! @brief KHCI state structure */
typedef struct _usb_device_khci_state_struct {
    uint8_t* bdt;				/*!< BDT buffer address */
    USB_OTG_FS_TypeDef*  registerBase;
								/*!< The base address of the register */
    uint8_t setupPacketBuffer[USB_SETUP_PACKET_SIZE * 2]; 
								/*!< The setup request buffer */
    uint8_t* dmaAlignBuffer;	/*!< This buffer is used to fix the transferBuffer or transferLength does
                               not align to 4-bytes when the function USB_DeviceKhciRecv is called.
                               The macro USB_DEVICE_CONFIG_KHCI_DMA_ALIGN is used to enable or disable this feature.
                               If the feature is enabled, when the transferBuffer or transferLength does not align to
                               4-bytes,
                               the transferLength is not more than USB_DEVICE_CONFIG_KHCI_DMA_ALIGN_BUFFER_LENGTH, and
                               the flag isDmaAlignBufferInusing is zero, the dmaAlignBuffer is used to receive data
                               and the flag isDmaAlignBufferInusing is set to 1.
                               When the transfer is done, the received data, kept in dmaAlignBuffer, is copied
                               to the transferBuffer, and the flag isDmaAlignBufferInusing is cleared.
                                */
    usb_device_khci_endpoint_state_struct_t endpointState[USB_DEVICE_CONFIG_ENDPOINTS * 2]; 
								/*!< Endpoint state structures */
    uint8_t isDmaAlignBufferInusing;	/*!< The dmaAlignBuffer is used or not */
    uint8_t isResetting;		/*!< Is doing device reset or not */
    uint8_t controllerId;		/*!< Controller ID */
    uint8_t setupBufferIndex;	/*!< A valid setup buffer flag */
} usb_device_khci_state_struct_t;

/* Set BDT buffer address */
#define USB_KHCI_BDT_SET_ADDRESS(bdt_base, ep, direction, odd, address)         \
    *((volatile uint32_t *)((bdt_base & 0xfffffe00U) | \
    (((uint32_t)ep & 0x0fU) << 5U) | (((uint32_t)direction & 1U) << 4U) | \
    (((uint32_t)odd & 1U) << 3U)) + 1U) = address

/* Set BDT control fields*/
#define USB_KHCI_BDT_SET_CONTROL(bdt_base, ep, direction, odd, control)         \
    *(volatile uint32_t *)((bdt_base & 0xfffffe00U) | \
    (((uint32_t)ep & 0x0fU) << 5U) | (((uint32_t)direction & 1U) << 4U) | \
    (((uint32_t)odd & 1U) << 3U)) = control

/* Get BDT buffer address*/
#define USB_KHCI_BDT_GET_ADDRESS(bdt_base, ep, direction, odd)                  \
    (*((volatile uint32_t *)((bdt_base & 0xfffffe00U) | \
    (((uint32_t)ep & 0x0fU) << 5U) | (((uint32_t)direction & 1U) << 4U) | \
    (((uint32_t)odd & 1U) << 3U)) + 1U))

/* Get BDT control fields*/
#define USB_KHCI_BDT_GET_CONTROL(bdt_base, ep, direction, odd)                  \
    (*(volatile uint32_t *)((bdt_base & 0xfffffe00U) | \
    (((uint32_t)ep & 0x0fU) << 5U) | (((uint32_t)direction & 1U) << 4U) |\
    (((uint32_t)odd & 1U) << 3U)))

	
	
#define USB_DEVICE_CONFIG_KHCI_DMA_ALIGN_BUFFER_LENGTH 64U	
	
	
#define USB_GLOBAL		USB_LINK_USB_GLOBAL_BSS
#define USB_BDT			USB_LINK_USB_BDT_BSS

USB_BDT 	USB_RAM_ADDRESS_ALIGNMENT(512) 	static uint8_t s_UsbDeviceKhciBdtBuffer[512U];
USB_GLOBAL 	USB_RAM_ADDRESS_ALIGNMENT(4) 	static usb_device_khci_state_struct_t khciState;
USB_GLOBAL 	USB_RAM_ADDRESS_ALIGNMENT(4)	static uint32_t s_UsbDeviceKhciDmaAlignBuffer[((64U - 1U) >> 2U) + 1U];

#define BDT_BASE				(uint32_t)(uint8_t*)(s_UsbDeviceKhciBdtBuffer)

////////////////////////////////////////////////////////////////////////////////
void USB_Clock_Config(void)
{
	/* configure CRS */
	RCC_APB1PeriphClockCmd(RCC_APB1ENR_CRS, ENABLE);
    CRS->CFGR &= ~CRS_CFGR_RELOAD;
    CRS->CFGR |= 0xBB7F;	// RELOAD=47999
    CRS->CFGR &= ~CRS_CFGR_SRC;
    CRS->CFGR |= CRS_CFGR_SRC_USBSOF;
    CRS->CR |= CRS_CR_AUTOTRIMEN;
    CRS->CR |= CRS_CR_CNTEN;
	/* Select USBCLK source */
    RCC_USBCLKConfig(RCC_USBCLKSource_PLLCLK_Div2);
	/* Enable USB clock */
	RCC_AHB2PeriphClockCmd(RCC_AHB2ENR_USBFS, ENABLE);
}

////////////////////////////////////////////////////////////////////////////////
// @brief De-initialize the USB device KHCI instance.
// 
////////////////////////////////////////////////////////////////////////////////
static void USB_DeviceKhciDeinit(void)
{
	/* Clear all interrupt flags. */
    khciState.registerBase->INT_STAT = 0xFFU;
    /* Disable all interrupts. */
    khciState.registerBase->INT_ENB &= ~(0xFFU);
    /* Clear device address. */
    khciState.registerBase->ADDR = (0U);
    /* Clear USB_CTL register */
    khciState.registerBase->CTL = 0x00U;
}

static void USB_DeviceKhciCancel(uint8_t ep)
{
    uint8_t index = ((ep & USB_ENDPOINT_NUMBER_MASK) << 1U) | ((ep & USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_MASK) >>
                    USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);

    /* Cancel the transfer and notify the up layer when the endpoint is busy. */
    if (khciState.endpointState[index].stateUnion.stateBitField.transferring) {
        khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
    }
}

