ChenDudo/DAPLink/source/hic_hal/mm32/mm32f3270/usbd_mm32F3270 copy.c
void USB_DeviceKhciEndpointDeinit(uint8_t ep)
{
    uint8_t endpoint = (ep & USB_ENDPOINT_NUMBER_MASK);
    uint8_t direction = (ep & USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_MASK) >> USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT;
    uint8_t index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    /* Cancel the transfer of the endpoint */
    USB_DeviceKhciCancel(ep);
    /* Disable the endpoint */
    khciState.registerBase->EP_CTL[endpoint] = 0x00U;
    /* Clear the max packet size */
    khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize = 0U;
}

static void USB_DeviceKhciSetDefaultState(void)
{
	uint8_t interruptFlag;
	
	/* Clear the error state register */
    khciState.registerBase->ERR_STAT = 0xFFU;
	
    /* Setting this bit to 1U resets all the BDT ODD ping/pong fields to 0U, which then specifies the EVEN BDT bank. */
    khciState.registerBase->CTL |= USB_CTL_ODDRST_MASK;
	
    /* Clear the device address */
    khciState.registerBase->ADDR = 0U;
	
    /* Clear the endpoint state and disable the endpoint */
    for (uint8_t count = 0U; count < USB_DEVICE_CONFIG_ENDPOINTS; count++) {
        USB_KHCI_BDT_SET_CONTROL((uint32_t)khciState.bdt, count, USB_OUT, 0U, 0U);
        USB_KHCI_BDT_SET_CONTROL((uint32_t)khciState.bdt, count, USB_OUT, 1U, 0U);
        USB_KHCI_BDT_SET_CONTROL((uint32_t)khciState.bdt, count, USB_IN, 0U, 0U);
        USB_KHCI_BDT_SET_CONTROL((uint32_t)khciState.bdt, count, USB_IN, 1U, 0U);
        khciState.endpointState[((uint32_t)count << 1U) | USB_OUT].stateUnion.state = 0U;
        khciState.endpointState[((uint32_t)count << 1U) | USB_IN].stateUnion.state = 0U;
        khciState.registerBase->EP_CTL[count] = 0x00U;
    }
	khciState.isDmaAlignBufferInusing = 0U;
	
	/* Clear the BDT odd reset flag */
    khciState.registerBase->CTL &= ~USB_CTL_ODDRST_MASK;
	
	/* Enable all error */
    khciState.registerBase->ERR_ENB = 0xFFU;

	/* Enable all error */
    USB_OTG_FS->ERR_ENB = 0xFFU;
	
	 /* Enable reset, sof, token, stall interrupt */
    interruptFlag = kUSB_KhciInterruptReset | kUSB_KhciInterruptTokenDone;
	
	/* Write the interrupt enable register */
    khciState.registerBase->INT_ENB = interruptFlag;

	/* Clear reset flag */
    khciState.isResetting = 0U;

    khciState.registerBase->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
}

//    USB_OTG_FS->CTL |= OTG_FS_CTL_USB_EN_SOF_EN;    /*USB device enable */
    
void USB_DeviceKhciInit(void)
{
	khciState.registerBase = (USB_OTG_FS_TypeDef*)USB_OTG_FS;

    khciState.dmaAlignBuffer = (uint8_t*)s_UsbDeviceKhciDmaAlignBuffer;

    /* Clear all interrupt flags. */
    khciState.registerBase->INT_STAT = 0xFFU;

    khciState.bdt = (uint8_t*)(s_UsbDeviceKhciBdtBuffer);

    /* Set BDT buffer address */
    khciState.registerBase->BDT_PAGE_01 = (uint8_t)((((uint32_t)khciState.bdt) >> 8U) & 0xFFU);
    khciState.registerBase->BDT_PAGE_02 = (uint8_t)((((uint32_t)khciState.bdt) >> 16U) & 0xFFU);
    khciState.registerBase->BDT_PAGE_03 = (uint8_t)((((uint32_t)khciState.bdt) >> 24U) & 0xFFU);

    /* Set KHCI device state to default value. */
    USB_DeviceKhciSetDefaultState();
}

/*
 *  USB Device Interrupt enable
 *   Called by USBD_Init to enable the USB Interrupt
 *    Return Value:    None
 */
#ifdef __RTX
void __svc(1) USBD_IntrEna(void);
void __SVC_1(void) {
#else
void          USBD_IntrEna(void) {
#endif
    NVIC_EnableIRQ(USB_FS_IRQn);
}

/*
 *  USB Device Initialize Function
 *   Called by the User to initialize USB Device
 *    Return Value:    None
 */
void USBD_Init(void)
{
	USB_Clock_Config();
    
	USB_DeviceKhciInit();
	USB_OTG_FS->CTL |= OTG_FS_CTL_USB_EN_SOF_EN;
	USBD_IntrEna();
    USBD_Reset();
}

/*
 *  USB Device Connect Function
 *   Called by the User to Connect/Disconnect USB Device
 *    Parameters:      con:   Connect/Disconnect
 *    Return Value:    None
 */
void USBD_Connect(BOOL con)
{
    (con) ? (USB_OTG_FS->CTL |= OTG_FS_CTL_USB_EN_SOF_EN) : \
		(USB_OTG_FS->CTL &= ~OTG_FS_CTL_USB_EN_SOF_EN);
}

void USB_DeviceKhciEndpointTransfer(uint8_t endpoint, uint8_t direction, uint8_t* buffer, uint32_t length)
{
    uint32_t index = ((uint32_t)endpoint << 1U) | (uint32_t)direction;

    /* Flag the endpoint is busy. */
    khciState.endpointState[index].stateUnion.stateBitField.transferring = 1U;

    /* Add the data buffer address to the BDT. */
    USB_KHCI_BDT_SET_ADDRESS((uint32_t)khciState.bdt, endpoint, direction, khciState.endpointState[index].stateUnion.stateBitField.bdtOdd, (uint32_t)buffer);

    /* Change the BDT control field to start the transfer. */
    USB_KHCI_BDT_SET_CONTROL((uint32_t)khciState.bdt, endpoint, direction, khciState.endpointState[index].stateUnion.stateBitField.bdtOdd,
        USB_LONG_TO_LITTLE_ENDIAN(USB_KHCI_BDT_BC(length) | USB_KHCI_BDT_OWN | USB_KHCI_BDT_DTS | USB_KHCI_BDT_DATA01(khciState.endpointState[index].stateUnion.stateBitField.data0)));

    /* Clear the token busy state */
    khciState.registerBase->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
}


static void USB_DeviceKhciPrimeNextSetup(void)
{
    /* Update the endpoint state */
    /* Save the buffer address used to receive the setup packet. */
    khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_OUT].transferBuffer =
        (uint8_t*)&khciState.setupPacketBuffer[0] + khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_OUT].stateUnion.stateBitField.bdtOdd * USB_SETUP_PACKET_SIZE;
	
    /* Clear the transferred length. */
    khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_OUT].transferDone = 0U;
    /* Save the data length expected to get from a host. */
    khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_OUT].transferLength = USB_SETUP_PACKET_SIZE;
    /* Save the data buffer DMA align flag. */
    khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_OUT].stateUnion.stateBitField.dmaAlign = 1U;
    /* Set the DATA0/1 to DATA0. */
    khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_OUT].stateUnion.stateBitField.data0 = 0U;

    USB_DeviceKhciEndpointTransfer(USB_CONTROL_ENDPOINT, USB_OUT, khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_OUT].transferBuffer, USB_SETUP_PACKET_SIZE);
}

void USB_DeviceKhciRecv(uint8_t endpointAddress, uint8_t* buffer, uint32_t length)
{
    uint32_t index = ((endpointAddress & USB_ENDPOINT_NUMBER_MASK) << 1U) | USB_OUT;

    if ((0U == length) && (USB_CONTROL_ENDPOINT == (endpointAddress & USB_ENDPOINT_NUMBER_MASK))) {
        khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
        USB_DeviceKhciPrimeNextSetup();
    }
    else {
        /* Save the tansfer information */
        if (0U == khciState.endpointState[index].stateUnion.stateBitField.transferring) {
            khciState.endpointState[index].transferDone = 0U;
            khciState.endpointState[index].transferBuffer = buffer;
            khciState.endpointState[index].transferLength = length;
        }
        khciState.endpointState[index].stateUnion.stateBitField.dmaAlign = 1U;

