ChenDudo/DAPLink/source/hic_hal/mm32/mm32f3270/usbd_mm32F3270 copy.c
        /* Data length needs to less than max packet size in each call. */
        if (length > khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize) {
            length = khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize;
        }

        buffer = (uint8_t*)((uint32_t)buffer + (uint32_t)khciState.endpointState[index].transferDone);

        if ((khciState.dmaAlignBuffer) && (0U == khciState.isDmaAlignBufferInusing) &&
                (USB_DEVICE_CONFIG_KHCI_DMA_ALIGN_BUFFER_LENGTH >= length) &&
                ((length & 0x03U) || (((uint32_t)buffer) & 0x03U))) {
            khciState.endpointState[index].stateUnion.stateBitField.dmaAlign = 0U;
            buffer = khciState.dmaAlignBuffer;
            khciState.isDmaAlignBufferInusing = 1U;
        }

        /* Receive data when the device is not resetting. */
        if (0U == khciState.isResetting) {
            USB_DeviceKhciEndpointTransfer(endpointAddress & USB_ENDPOINT_NUMBER_MASK, USB_OUT, buffer, length);
        }
    }
}

void USB_DeviceKhciSend(uint8_t endpointAddress, uint8_t* buffer, uint32_t length)
{
    uint32_t index = ((endpointAddress & USB_ENDPOINT_NUMBER_MASK) << 1U) | USB_IN;

    /* Save the tansfer information */
    if (0U == khciState.endpointState[index].stateUnion.stateBitField.transferring) {
        khciState.endpointState[index].transferDone = 0U;
        khciState.endpointState[index].transferBuffer = buffer;
        khciState.endpointState[index].transferLength = length;
        khciState.endpointState[index].stateUnion.stateBitField.dmaAlign = 1U;
    }

    /* Data length needs to less than max packet size in each call. */
    if (length > khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize) {
        length = khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize;
    }

    /* Send data when the device is not resetting. */
    if (0U == khciState.isResetting) {
        USB_DeviceKhciEndpointTransfer(endpointAddress & USB_ENDPOINT_NUMBER_MASK, USB_IN,\
		(uint8_t*)((uint32_t)khciState.endpointState[index].transferBuffer + (uint32_t)khciState.endpointState[index].transferDone), length);
    }

    /* Prime a transfer to receive next setup packet if the dat length is zero in a control in endpoint. */
    if ((0U == khciState.endpointState[index].transferDone) && (0U == length) && (USB_CONTROL_ENDPOINT == (endpointAddress & USB_ENDPOINT_NUMBER_MASK))) {
        USB_DeviceKhciPrimeNextSetup();
    }
}

static void USB_DeviceKhciInterruptReset(void)
{
    /* Set KHCI reset flag */
    khciState.isResetting = 1U;

    /* Clear the reset interrupt */
    khciState.registerBase->INT_STAT = (kUSB_KhciInterruptReset);
}

void USB_DeviceKhciInterruptTokenDone(void)
{
    uint32_t control, length, remainingLength;
    uint8_t* bdtBuffer;
    uint8_t endpoint, direction, bdtOdd, isSetup;
    uint8_t index;
    uint8_t stateRegister = khciState.registerBase->STAT;

    /* Get the endpoint number to identify which one triggers the token done interrupt. */
    endpoint 	= (stateRegister & USB_STAT_ENDP_MASK) 	>> USB_STAT_ENDP_SHIFT;
    direction	= (stateRegister & USB_STAT_TX_MASK)	>> USB_STAT_TX_SHIFT;
    bdtOdd		= (stateRegister & USB_STAT_ODD_MASK) 	>> USB_STAT_ODD_SHIFT;
    /* Clear token done interrupt flag. */
    khciState.registerBase->INT_STAT = kUSB_KhciInterruptTokenDone;
    /* Get the Control field of the BDT element according to the endpoint number, the direction and finished BDT ODD. */
    control = USB_KHCI_BDT_GET_CONTROL((uint32_t)khciState.bdt, endpoint, direction, bdtOdd);
    /* Get the buffer field of the BDT element according to the endpoint number, the direction and finished BDT ODD. */
    bdtBuffer = (uint8_t*)USB_KHCI_BDT_GET_ADDRESS((uint32_t)khciState.bdt, endpoint, direction, bdtOdd);
    /* Get the transferred length. */
    length = ((USB_LONG_FROM_LITTLE_ENDIAN(control)) >> 16U) & 0x3FFU;
    isSetup = (USB_KHCI_BDT_DEVICE_SETUP_TOKEN == ((uint8_t)(((USB_LONG_FROM_LITTLE_ENDIAN(control)) >> 2U) & 0x0FU))) ?
              1U :
              0U;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    if (0U == khciState.endpointState[index].stateUnion.stateBitField.transferring) {
        return;
    }

    if (isSetup) {
        khciState.setupBufferIndex = bdtOdd;
    }

    /* USB_IN, Send completed */
    if (direction == USB_IN) {
        /* The transferred length */
        khciState.endpointState[index].transferDone += length;
        /* Remaining length */
        remainingLength = khciState.endpointState[index].transferLength - khciState.endpointState[index].transferDone;
        /* Change the data toggle flag */
        khciState.endpointState[index].stateUnion.stateBitField.data0 ^= 1U;
        /* Change the BDT odd toggle flag */
        khciState.endpointState[index].stateUnion.stateBitField.bdtOdd ^= 1U;
        /* Whether the transfer is completed or not. */
        /* The transfer is completed when one of the following conditions meet:
         * 1. The remaining length is zero.
         * 2. The length of current transcation is less than the max packet size of the current pipe.*/
        if ((0U == remainingLength) || (khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize > length)) {
            khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;

            /* Whether need to send ZLT when the pipe is control in pipe and the transferred length of current
             * transaction equals to max packet size.            */
            if ((length) && (!(length % khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize))) {
                if (USB_CONTROL_ENDPOINT == endpoint) {
                    usb_setup_struct_t* setup_packet = (usb_setup_struct_t*)(&khciState.setupPacketBuffer[(USB_SETUP_PACKET_SIZE * khciState.setupBufferIndex)]);
                    /* Send the ZLT and terminate the token done interrupt service when the tranferred length in data phase is less than the host request. */
                    if (USB_SHORT_FROM_LITTLE_ENDIAN(setup_packet->wLength) > khciState.endpointState[index].transferLength) {
                        (void)USB_DeviceKhciEndpointTransfer(endpoint, USB_IN, (uint8_t*)NULL, 0U); return;
                    }
                }
                else if (khciState.endpointState[index].stateUnion.stateBitField.zlt) {
                    (void)USB_DeviceKhciEndpointTransfer(endpoint, USB_IN, (uint8_t*)NULL, 0U); return;
                }
            }
        }
        else {
            /* Send remaining data and terminate the token done interrupt service. */
            (void)USB_DeviceKhciSend(endpoint | (USB_IN << 0x07U), khciState.endpointState[index].transferBuffer, remainingLength);
            return;
        }
    }
    else {
        if (!((USB_CONTROL_ENDPOINT == endpoint) && (0U == length))) {
            if (0U == khciState.endpointState[index].stateUnion.stateBitField.dmaAlign) {
                uint8_t* buffer = (uint8_t*)USB_LONG_FROM_LITTLE_ENDIAN(
                                      USB_KHCI_BDT_GET_ADDRESS((uint32_t)khciState.bdt, endpoint, USB_OUT,
                                              khciState.endpointState[index].stateUnion.stateBitField.bdtOdd));
                uint8_t* transferBuffer =
                    khciState.endpointState[index].transferBuffer + khciState.endpointState[index].transferDone;
                if (buffer != transferBuffer) {
                    for (uint32_t i = 0U; i < length; i++) {
                        transferBuffer[i] = buffer[i];
                    }
                }
                khciState.isDmaAlignBufferInusing = 0U;
            }
            /* The transferred length */
            khciState.endpointState[index].transferDone += length;
            /* Remaining length */
            remainingLength = khciState.endpointState[index].transferLength - khciState.endpointState[index].transferDone;

