ChenDudo/DAPLink/source/hic_hal/mm32/mm32f3270/usbd_mm32F3270 copy.c
            if ((USB_CONTROL_ENDPOINT == endpoint) && isSetup) {
                khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_OUT].stateUnion.stateBitField.data0 = 1U;
                khciState.endpointState[(USB_CONTROL_ENDPOINT << 1U) | USB_IN].stateUnion.stateBitField.data0 = 1U;
            }
            else {
                khciState.endpointState[index].stateUnion.stateBitField.data0 ^= 1U;
            }
            khciState.endpointState[index].stateUnion.stateBitField.bdtOdd ^= 1U;
            if ((!khciState.endpointState[index].transferLength) || (!remainingLength) || (khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize > length)) {
//                message.length = khciState.endpointState[index].transferDone;
//                if (isSetup) {
//                    message.buffer = bdtBuffer;
//                }
//                else {
//                    message.buffer = khciState.endpointState[index].transferBuffer;
//                }
                khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
            }
            else {
                /* Receive remaining data and terminate the token done interrupt service. */
                USB_DeviceKhciRecv((endpoint) | (USB_OUT << 0x07U), khciState.endpointState[index].transferBuffer, remainingLength);
                return;
            }
        }
    }

    khciState.registerBase->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
}


/*
 *  USB Device Reset Function
 *   Called automatically on USB Device Reset
 *    Return Value:    None
 */
void USBD_Reset(void)
{//USB_DeviceKhciInterruptReset()
    NVIC_DisableIRQ(USB_FS_IRQn);
	
	USB_DeviceKhciInterruptReset();

    NVIC_EnableIRQ(USB_FS_IRQn);
}


/*
 *  USB Device Suspend Function
 *   Called automatically on USB Device Suspend
 *    Return Value:    None
 */
void USBD_Suspend(void)
{
    /* Performed by Hardware */
}

/*
 *  USB Device Resume Function
 *   Called automatically on USB Device Resume
 *    Return Value:    None
 */
void USBD_Resume(void)
{
    /* Performed by Hardware */
	khciState.registerBase->CTL |= USB_CTL_RESUME_MASK;
	
	uint16_t i = 1000;
	while(i--){
		__ASM("nop");
	};
	
	khciState.registerBase->CTL &= ~USB_CTL_RESUME_MASK;
}

/*
 *  USB Device Remote Wakeup Function
 *   Called automatically on USB Device Remote Wakeup
 *    Return Value:    None
 */
void USBD_WakeUp(void)
{
    // no neeed
}

/*
 *  USB Device Remote Wakeup Configuration Function
 *    Parameters:      cfg:   Device Enable/Disable
 *    Return Value:    None
 */
void USBD_WakeUpCfg(BOOL cfg)
{
    // no need
    if (cfg) {
        
    }
    else {
        
    }
}

/*
 *  USB Device Set Address Function
 *    Parameters:      adr:   USB Device Address
 *                     setup: Called in setup stage (!=0), else after status stage
 *    Return Value:    None
 */
void USBD_SetAddress(U32 adr, U32 setup)
{
    if (!setup) {
        USB_OTG_FS->ADDR &= ~OTG_FS_ADDR_ADDR;
        USB_OTG_FS->ADDR |= adr | 0x7FU;
    }
}

/*
 *  USB Device Configure Function
 *    Parameters:      cfg:   Device Configure/Deconfigure
 *    Return Value:    None
 */
void USBD_Configure(BOOL cfg)
{
    if (!cfg) {

    }
}


/*
 *  Configure USB Device Endpoint according to Descriptor
 *    Parameters:      pEPD:  Pointer to USB_ENDPOINT_DESCRIPTOR
 *                  U8  bLength;
 *                  U8  bDescriptorType;
 *                  U8  bEndpointAddress;
 *                  U8  bmAttributes;
 *                  U16 wMaxPacketSize;
 *                  U8  bInterval;
 *    Return Value:    None
 */
void USB_DeviceKhciEndpointInit(USB_ENDPOINT_DESCRIPTOR *pEPD)
{	
    uint16_t maxPacketSize = pEPD->bEndpointAddress;
    uint8_t endpoint = (pEPD->bEndpointAddress & USB_ENDPOINT_NUMBER_MASK);
    uint8_t direction = (pEPD->bEndpointAddress & USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_MASK) >>
                        USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT;
    uint8_t index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;
	uint8_t type = pEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK;
	
    /* Make the endpoint max packet size align with USB Specification 2.0. */
    if (USB_ENDPOINT_ISOCHRONOUS == type) {
        if (maxPacketSize > 1023U) maxPacketSize = 1023U;
    }
    else {
		if (maxPacketSize > 64U) maxPacketSize = 64U;
        /* Enable an endpoint to perform handshaking during a transaction to this endpoint. */
        khciState.registerBase->EP_CTL[endpoint] |= USB_ENDPT_EPHSHK_MASK;
    }
    /* Set the endpoint idle */
    khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
    /* Save the max packet size of the endpoint */
    khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize = maxPacketSize;
    /* Set the data toggle to DATA0 */
    khciState.endpointState[index].stateUnion.stateBitField.data0 = 0U;
    /* Clear the endpoint stalled state */
    khciState.endpointState[index].stateUnion.stateBitField.stalled = 0U;
    /* Set the ZLT field */
    khciState.endpointState[index].stateUnion.stateBitField.zlt = 0U;
    /* Enable the endpoint. */
    khciState.registerBase->EP_CTL[endpoint] |= (USB_IN == direction) ? USB_ENDPT_EPTXEN_MASK : USB_ENDPT_EPRXEN_MASK;

    /* Prime a transfer to receive next setup packet when the endpoint is control out endpoint. */
    if ((USB_CONTROL_ENDPOINT == endpoint) && (USB_OUT == direction)) {
        USB_DeviceKhciPrimeNextSetup();
    }
}


void USBD_ConfigEP(USB_ENDPOINT_DESCRIPTOR *pEPD)
{
	USB_DeviceKhciEndpointInit((USB_ENDPOINT_DESCRIPTOR*)pEPD);
	
//    uint32_t num, val, type;
//    uint8_t endpoint, direction;
//    uint32_t index;

//    num  = pEPD->bEndpointAddress;
//    val  = pEPD->wMaxPacketSize;
//    type = pEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK;
//    endpoint = (num & 0x0FU);
//    direction = (num & 0x80U) >> 7;
//    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

//    /* Make the endpoint max packet size align with USB Specification 2.0. */
//    if (USB_ENDPOINT_ISOCHRONOUS == type) {
//        if (val > 1023U)    val = 1023U;
//    }
//    else {
//        if (val > 64U)      val = 64U;
//        /* Enable an endpoint to perform handshaking during a transaction to this endpoint. */
//        USB_OTG_FS->EP_CTL[endpoint] |= USB_ENDPT_EPHSHK_MASK;
//    }
//    /* Set the endpoint idle */
//    khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
//    /* Save the max packet size of the endpoint */
//    khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize = val;
//    /* Set the data toggle to DATA0 */
//    khciState.endpointState[index].stateUnion.stateBitField.data0 = 0U;
//    /* Clear the endpoint stalled state */
//    khciState.endpointState[index].stateUnion.stateBitField.stalled = 0U;
//    /* Set the ZLT field */
//    //khciState.endpointState[index].stateUnion.stateBitField.zlt = pEPD->bInterval; //TODO ???

//    // /* Enable the endpoint. */   // TODO ???
//    // USB_OTG_FS->EP_CTL[endpoint] |= (USB_IN == direction) ? USB_ENDPT_EPTXEN_MASK : USB_ENDPT_EPRXEN_MASK;
//    
//    /* Prime a transfer to receive next setup packet when the endpoint is control out endpoint. */
//    if (USB_OUT == direction) {
//        uint8_t epIndex = (endpoint << 1U) | USB_OUT;
//        khciState.endpointState[epIndex].transferBuffer = (uint8_t*)s_next_ep_buf_addr;
//        /* Clear the transferred length. */
//        khciState.endpointState[epIndex].transferDone = 0U;
//        /* Save the data length expected to get from a host. */
//        khciState.endpointState[epIndex].transferLength = val; //USB_SETUP_PACKET_SIZE;
//        /* Save the data buffer DMA align flag. */
//        khciState.endpointState[epIndex].stateUnion.stateBitField.dmaAlign = 1U;

//        /* Add the data buffer address to the BDT. */
//        USB_KHCI_BDT_SET_ADDRESS(BDT_BASE, endpoint, USB_OUT, khciState.endpointState[epIndex].stateUnion.stateBitField.bdtOdd, (uint32_t)khciState.endpointState[epIndex].transferBuffer);
//        /* Change the BDT control field to start the transfer. */
//        USB_KHCI_BDT_SET_CONTROL(BDT_BASE, endpoint, USB_OUT, khciState.endpointState[epIndex].stateUnion.stateBitField.bdtOdd,\
//            (uint32_t)(USB_KHCI_BDT_BC(val) | USB_KHCI_BDT_OWN | USB_KHCI_BDT_DTS | USB_KHCI_BDT_DATA01(khciState.endpointState[epIndex].stateUnion.stateBitField.data0)));
//        
//        //USB_OTG_FS->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK; //* Clear the token busy state */
//    }
//    else {
//        uint8_t epIndex = (endpoint << 1U) | USB_IN;
//        khciState.endpointState[epIndex].transferBuffer = (uint8_t *)s_next_ep_buf_addr;
//        /* Clear the transferred length. */
//        khciState.endpointState[epIndex].transferDone = 0U;
//        /* Save the data length expected to get from a host. */
//        khciState.endpointState[epIndex].transferLength = val;
//        /* Save the data buffer DMA align flag. */
//        khciState.endpointState[epIndex].stateUnion.stateBitField.dmaAlign = 1U;

//        /* Add the data buffer address to the BDT. */
//        USB_KHCI_BDT_SET_ADDRESS(BDT_BASE, endpoint, USB_IN, khciState.endpointState[epIndex].stateUnion.stateBitField.bdtOdd, (uint32_t)khciState.endpointState[epIndex].transferBuffer);
//        /* Change the BDT control field to start the transfer. */
//        USB_KHCI_BDT_SET_CONTROL(BDT_BASE, endpoint, USB_IN, khciState.endpointState[epIndex].stateUnion.stateBitField.bdtOdd,\
//            (uint32_t)(USB_KHCI_BDT_BC(val) | USB_KHCI_BDT_OWN | USB_KHCI_BDT_DTS | USB_KHCI_BDT_DATA01(khciState.endpointState[epIndex].stateUnion.stateBitField.data0)));
//    }
}

