ChenDudo/DAPLink/source/hic_hal/mm32/mm32f3270/usbd_mm32F3270 copy.c
/*
 *  Set Direction for USB Device Control Endpoint
 *    Parameters:      dir:   Out (dir == 0), In (dir <> 0)
 *    Return Value:    None
 */
void USBD_DirCtrlEP(U32 dir)
{
    /* Not needed */
}

/*
 *  Enable USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */
void USBD_EnableEP(U32 EPNum)
{
    uint8_t endpoint, direction;
    uint32_t index;

    endpoint = (EPNum & 0x0FU);
    direction = (EPNum & 0x80U) >> 7;
	index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;
	
    /* Enable the endpoint. */
    
}

/*
 *  Disable USB Endpoint
 *  Parameters:     EPNum: Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *  Return Value:   None
 */
void USBD_DisableEP(U32 EPNum)
{
/* The function is used to de-initialize a specified endpoint.
 * Current transfer of the endpoint will be canceled and the specified endpoint will be disabled..
 * @param EPNum The endpoint address, Bit7, 0U - USB_OUT, 1U - USB_IN.
 */
	USB_DeviceKhciEndpointDeinit(EPNum);
}

/*
 *  Reset USB Device Endpoint
 *  Parameters:     EPNum: Device Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *  Return Value:   None
 */
void USBD_ResetEP(U32 EPNum)
{
    // Todo::: reset EP vs deinit EP vs disable EP
    // uint8_t endpoint, direction;
    // uint32_t index;

    // endpoint = (EPNum & 0x0FU);
    // direction = (EPNum & 0x80U) >> 7;
    // index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    // /* Prime a transfer to receive next setup packet when the endpoint is a control out endpoint. */
    // if ((USB_CONTROL_ENDPOINT == endpoint) && (USB_OUT == direction)) {
    //     USB_DeviceKhciPrimeNextSetup();
    // }
}

/*
 *  Set Stall for USB Device Endpoint
 *  Parameters:     EPNum: Device Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *  Return Value:   None
 */
void USBD_SetStallEP(U32 EPNum)
{
    uint8_t endpoint, direction;
    uint32_t index;

    endpoint = (EPNum & 0x0FU);
    direction = (EPNum & 0x80U) >> 7;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    /* Cancel the transfer of the endpoint */
    if (khciState.endpointState[index].stateUnion.stateBitField.transferring) {
        khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
    }
    /* Set endpoint stall flag. */
    khciState.endpointState[index].stateUnion.stateBitField.stalled = 1U;
    /* Set endpoint stall in BDT. And then if the host send a IN/OUT tanscation, the device will response a STALL state.*/
    USB_KHCI_BDT_SET_CONTROL(BDT_BASE, endpoint, direction, khciState.endpointState[index].stateUnion.stateBitField.bdtOdd,\
                USB_LONG_TO_LITTLE_ENDIAN((uint32_t)(USB_KHCI_BDT_BC(khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize) | \
                    USB_KHCI_BDT_DTS | USB_KHCI_BDT_STALL | USB_KHCI_BDT_OWN)));
    USB_OTG_FS->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
}


/*
 *  Clear Stall for USB Device Endpoint
 *  Parameters:     EPNum: Device Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *  Return Value:   None
 */
void USBD_ClrStallEP(U32 EPNum)
{
    uint8_t endpoint, direction;
    uint32_t index;

    endpoint = (EPNum & 0x0FU);
    direction = (EPNum & 0x80U) >> 7;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    /* Clear the endpoint stall state */
    khciState.endpointState[index].stateUnion.stateBitField.stalled = 0U;
    /* Reset the endpoint data toggle to DATA0 */
    khciState.endpointState[index].stateUnion.stateBitField.data0 = 0U;

    /* Clear stall state in BDT */
    for (uint8_t i = 0U; i < 2U; i++) {
        USB_KHCI_BDT_SET_CONTROL(BDT_BASE, endpoint, direction, i,
            USB_LONG_TO_LITTLE_ENDIAN((uint32_t)(USB_KHCI_BDT_BC(khciState.endpointState[index].stateUnion.stateBitField.maxPacketSize) | USB_KHCI_BDT_DTS | USB_KHCI_BDT_DATA01(0U))));
    }

    /* Clear stall state in endpoint control register */
    USB_OTG_FS->EP_CTL[endpoint] &= ~USB_ENDPT_EPSTALL_MASK;

    if ((USB_CONTROL_ENDPOINT != endpoint)) {
        if (khciState.endpointState[index].stateUnion.stateBitField.transferring) {
            khciState.endpointState[index].stateUnion.stateBitField.transferring = 0U;
        }
    }

    /* Prime a transfer to receive next setup packet when the endpoint is a control out endpoint. */
    if ((USB_CONTROL_ENDPOINT == endpoint) && (USB_OUT == direction)) {
        USB_DeviceKhciPrimeNextSetup();
    }

    USB_OTG_FS->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;

}

/*
 *  Clear USB Device Endpoint Buffer
 *  Parameters:     EPNum: Device Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *  Return Value:   None
 */
void USBD_ClearEPBuf(U32 EPNum)
{
    uint32_t  cnt, i;
    uint8_t  *dataptr;
    uint8_t endpoint, direction;
    uint32_t index;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;
    dataptr = khciState.endpointState[index].transferBuffer;
    cnt = khciState.endpointState[index].transferLength;
    for (i = 0; i < cnt; i++) {
        dataptr[i] = 0;
    }
}

/*
 *  Read USB Device Endpoint Data
 *  Parameters:     EPNum: Device Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *                      pData: Pointer to Data Buffer
 *  Return Value:   Number of bytes read
 */
U32 USBD_ReadEP(U32 EPNum, U8 *pData, U32 cnt)
{// OUT buffer
	uint8_t endpoint, direction;
    uint32_t index;
	uint8_t* buffer;
	
    endpoint = (EPNum & 0x0FU);
    direction = (EPNum & 0x80U) >> 7;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    if(USB_IN==direction){
        return 0;
    }

	//memcpy(pData, buffer, cnt); //TODO

