ChenDudo/DAPLink/source/hic_hal/mm32/mm32f3270/usbd_mm32F3270 copy.c
    return 0;
}

/*
 *  Write USB Device Endpoint Data
 *  Parameters:   EPNum: Device Endpoint Number
 *                      EPNum.0..3: Address
 *                      EPNum.7:    Dir
 *                   pData: Pointer to Data Buffer
 *                   cnt:   Number of bytes to write
 *  Return Value:   Number of bytes written
 */
U32 USBD_WriteEP(U32 EPNum, U8 *pData, U32 cnt)
{// IN buffer
    uint8_t endpoint, direction;
    uint32_t index;
    uint32_t* buffer;

    endpoint = (EPNum & 0x0FU);
    direction = (EPNum & 0x80U) >> 7;
    index = ((uint8_t)((uint32_t)endpoint << 1U)) | (uint8_t)direction;

    /* only IN EP */
    if (USB_OUT == direction) {
		return 0;
    }
	
	buffer= (uint32_t*)khciState.endpointState[index].transferBuffer + (uint32_t)khciState.endpointState[index].transferDone;
	
    
    return 0;
}

/*
 *  Get USB Device Last Frame Number
 *  Parameters:     None
 *  Return Value:   Frame Number
 */
U32 USBD_GetFrame(void)
{
    return 0;
}

/*
 *  Get USB Last Error Code
 *  Parameters:   None
 *  Return Value:   Error Code
 */
U32 USBD_GetError(void)
{
    return 0;
}


void tokenhandle()
{
//USB_DeviceKhciInterruptTokenDone();
		uint8_t stateRegister = USB_OTG_FS->STAT;
		uint8_t num, direction;
        
		/* Get the endpoint number to identify which one triggers the token done interrupt. */
        num = (stateRegister & USB_STAT_ENDP_MASK) >> USB_STAT_ENDP_SHIFT;

        /* Get the direction of the endpoint number. */
        direction = (stateRegister & USB_STAT_TX_MASK) >> USB_STAT_TX_SHIFT;

        /* Get the finished BDT ODD. */
        //bdtOdd = (stateRegister & USB_STAT_ODD_MASK) >> USB_STAT_ODD_SHIFT;

        /* Clear token done interrupt flag. */
        USB_OTG_FS->INT_STAT = kUSB_KhciInterruptTokenDone;

        if (USB_IN == direction) {
#ifdef __RTX
            if (USBD_RTX_EPTask[num])   isr_evt_set(USBD_EVT_IN,  USBD_RTX_EPTask[num]);
#else
            if (USBD_P_EP[num])         USBD_P_EP[num](USBD_EVT_IN);
#endif
        }
        if (USB_OUT == direction) {
            if (USB_CONTROL_ENDPOINT == num){
#ifdef __RTX
                if (USBD_RTX_EPTask[num / 2])   isr_evt_set(USBD_EVT_OUT, USBD_RTX_EPTask[num / 2]);
#else
                if (USBD_P_EP[num / 2])         USBD_P_EP[num](USBD_EVT_SETUP);
#endif
			}
            else {
#ifdef __RTX
				if (USBD_RTX_EPTask[num])   isr_evt_set(USBD_EVT_OUT,  USBD_RTX_EPTask[num]);
#else
				if (USBD_P_EP[num])         USBD_P_EP[num](USBD_EVT_OUT);
#endif
			}
		}
}

		
void USBD_Handler(void)
{
    uint32_t status = USB_OTG_FS->INT_STAT;
    //USB_OTG_FS->INT_STAT = status;

    /* Error interrupt */
    if (status & kUSB_KhciInterruptError) {
        USB_OTG_FS->INT_STAT |= kUSB_KhciInterruptError;
#ifdef __RTX
        if (USBD_RTX_DevTask)       isr_evt_set(USBD_EVT_ERROR, USBD_RTX_DevTask);
#else
        if (USBD_P_Error_Event)     USBD_P_Error_Event(1);
#endif
    }
    
    /* Suspend interrupt */
    if (status & kUSB_KhciInterruptSleep) {
        USBD_Suspend();
        USB_OTG_FS->INT_STAT |= kUSB_KhciInterruptSleep;
        //USB_DeviceKhciInterruptSleep(khciState.);
#ifdef __RTX
        if (USBD_RTX_DevTask)       isr_evt_set(USBD_EVT_SUSPEND, USBD_RTX_DevTask);
#else
        if (USBD_P_Suspend_Event)   USBD_P_Suspend_Event();
#endif
    }

    /* Start of Frame interrupt */
    if (status & kUSB_KhciInterruptSofToken) {
        USB_OTG_FS->INT_STAT |= kUSB_KhciInterruptSofToken;
#ifdef __RTX
        if (USBD_RTX_DevTask)       isr_evt_set(USBD_EVT_SOF, USBD_RTX_DevTask);
#else
        if (USBD_P_SOF_Event)       USBD_P_SOF_Event();
#endif
    }

    /* Reset interrupt */
    if (status & kUSB_KhciInterruptReset) {
        USB_OTG_FS->INT_STAT = kUSB_KhciInterruptReset;
        USBD_Reset();
        usbd_reset_core();
#ifdef __RTX
        if (USBD_RTX_DevTask)       isr_evt_set(USBD_EVT_RESET, USBD_RTX_DevTask);
#else
        if (USBD_P_Reset_Event)     USBD_P_Reset_Event();
#endif
    }

    /* Token done interrupt */
    if (status & kUSB_KhciInterruptTokenDone) {
        
	}

    NVIC_EnableIRQ(USB_FS_IRQn);
}

void OTG_FS_IRQHandler(void)
{
    NVIC_DisableIRQ(USB_FS_IRQn);
    USBD_SignalHandler();
}
